obliquedetonation/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        // molWeight   8.3144626e3; // =R [kg/kmol]
        // nMoles 1;
        // molWeight 29;
        molWeight       11640.3;
    }
    thermodynamics
    {
        // Cp 1005;
        Cp          2.5;  // gamma=5/3
        // Cp          6; // =gamma/(gamma-1)
        Hf          0;
    }
    transport
    {
        mu          0.;
        Pr          1;  // Prandtl number = nu/alpha
    }
}

Sc      1;  // Schmidt number = nu/D

// ************************************************************************* //
